{
    "builds": [
        {
            "aborted": true,
            "buildnum": 1,
            "graphid": "Zi-rCIvSRUm7t-CFbAaUYw",
            "human_tasks": {
                "publish": false,
                "shipit": true,
                "signoff": false
            },
            "issues": [
                "SPECIAL REQUIREMENT: Verify that the patches identified for desktop in [Bug 1397721](https://bugzilla.mozilla.org/show_bug.cgi?id=1397721#c17) has landed and reconfigured. DONE!",
                "POTENTIAL ISSUE: Cross-Channel L10n new in this release, should use l10n-central repo. See [Bug 1397721](https://bugzil.la/1397721)",
                "SPECIAL REQUIREMENT: cancel bouncer aliases job after graph submission, to prevent 57.0b1 appearing as a download at end of release process. DONE!",
                "nthomas: [Bug 1400119](https://bugzil.la/1400119) - source builder failed",
                "nthomas: [Bug 1400141](https://bugzil.la/1400141) - balrog submission errors, reran failing tasks",
                "jlorenzo: Because source builder failed, the rest of the graph was stuck. I didn't manage to force the source-related tasks to complete, because Taskcluster is too smart. To complete a task, you need it to be in pending. Otherwise, taskcluster doesn't accept a failed/exception task to change to complete. Also, running tasks are already claimed, and Taskcluster doesn't allow you to override the status. Workers were too fast to claim tasks. I haven't managed to get the right time window to mark tasks as completed. As a consequnce, build 2 was started with source turned off (hotfix)."
            ]
        },
        {
            "aborted": true,
            "buildnum": 2,
            "graphid": "SccqGTzATvqPXaVMW4LjJQ",
            "human_tasks": {
                "publish": false,
                "shipit": true,
                "signoff": false
            },
            "issues": [
                "jlorenzo: [Bug 1400141](https://bugzil.la/1400141)- About a dozen balrog submission errors, reran failing tasks",
                "jlorenzo: Manually cancelled bouncer aliases and mark as shipped. Then, bedrock won't show this version to users www.mozilla.org",
                "jlorenzo: [Bug 1400285](https://bugzil.la/1400285) - 57.0b1: All windows update verification tests are failing: diff: target/bin: No such file or directory"
            ]
        },
        {
            "aborted": false,
            "buildnum": 3,
            "graphid": "PqkUbYFlSqutB9EJQYTi8g",
            "human_tasks": {
                "publish": true,
                "shipit": true,
                "signoff": true
            },
            "issues": [
                "nthomas: Manually cancelled bouncer aliases and mark as shipped. Then, bedrock won't show this version to users www.mozilla.org",
                "nthomas: [Bug 1400656](https://bugzil.la/1400656) - purge devedition/releases/57.0b1/",
                "nthomas: [Bug 1400141](https://bugzil.la/1400141) - About 15 balrog submission errors, reran failing tasks",
                "nthomas: checksums failure after installing boto3 rather than boto, fallout from [Bug 1361930](https://bugzil.la/1361930). catlee moved aside boto3 and botocore on our pypi and puppet, reran job",
                "nthomas: push to mirrors failure because [Bug 1400656](https://bugzil.la/1400656) hadn't been done, paged cloudops then reran",
                "nthomas: uptake monitoring failed because no uptake of Devedition-57.0b1-Complete-bz2, fallout from [Bug 1395697](https://bugzil.la/1395697). Added a 1-btye keys at pub/devedition/releases/57.0b1/update/win64/en-US/firefox-57.0b1.bz2.complete.mar and so on and reran uptake",
                "jlorenzo: Manually cancelled 'mark as shipped' per [Bug 1400265](https://bugzil.la/1400265) comment 4",
                "nthomas: Release eta not set so balrog submitter tried to change the rule directly, manually added a signoff"
            ]
        }
    ],
    "date": "2017-09-15",
    "product": "devedition",
    "version": "57.0b1"
}